// Գրել ծրագիր, որը կկարդա n թիվը, և կգտնի բոլոր այն a և b թվերը, որոնք ենթարկվում են հետևյալ կանոնին՝
// a և b թվերի արտադրյալը պետք է հավասար լինի 1-ից մինչև n-ը ներառյալ բոլոր թվերի՝բացառությամբ այդ a և b,գումարին։


function sum(n, a, b) {
    return n * (n + 1) / 2 - a - b
}

function nums(n) {
    for (let a = 1; a <= n; a++) {
        for (let b = a + 1; b <= n; b++) {
            if (a !== b && a * b === sum(n, a, b)) {
                console.log("A =", a, "B =", b, "N =", n)
            }
        }
    }
}

nums()